# 소스파일 : 코드를 작성하는 공간
# + 프로그램을 위한 전체공간을 확보해주게 된다.

# 변수 : 전체 공간중 일부를 나눠쓰는 것
# + 자료(외부에서 수집된 것)를 보관하는 것이 목적이다.
# + 자료를 위한 "저장공간"

# 자료형 : 자료가 무엇인지에 대한 정보
# + 문법/규칙대로 작성/처리가 되어 준비된다/나온다
# + 저것이 무엇인지를 잘 식별해야 한다.

# 변수의 생성 : 이름은 식별하기 쉽게, 단어로 준비한다.
# - 피해야 할 것 : 전혀 연상되지 않는 것
# - 저장할 대상이 있어야만 변수를 만들 수 있다

# 상수 : 상비해두는 값, 미리 준비해두는 값
# - 숫자는 수치연산이 주 목적이다.
num1 = 100 # 정수
num2 = 200 
fnum1 = 3.14 # 실수
fnum2 = 99.187654321

# - 문자는 의사소통하는 것이 목적이다.
ramen = "라면" # 문자
bird = "새"

# - 논리는 상태를 표현한다.
isOpen = True # 논리
doorIsClosed = False